{"format": "graph-model", "generatedBy": "1.15.2", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"x": {"name": "Placeholder_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "42"}]}}, "a": {"name": "Placeholder_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}]}}}, "outputs": {"main/q1/Squeeze:0": {"name": "main/q1/Squeeze:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "main/mul_1:0": {"name": "main/mul_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}]}}, "main/q2/Squeeze:0": {"name": "main/q2/Squeeze:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "main/mul:0": {"name": "main/mul:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}]}}}}, "modelTopology": {"node": [{"name": "main/pi/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/pi/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/pi/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/pi/dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "main/pi/dense_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "300"}]}}}}}, {"name": "main/pi/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/pi/dense_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "12"}]}}}}}, {"name": "main/pi/dense_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/pi/clip_by_value/Minimum/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "main/pi/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "main/q1/dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "54"}, {"size": "400"}]}}}}}, {"name": "main/q1/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q1/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "300"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q1/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q1/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q1/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "42"}]}}}}, {"name": "main/q2/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "54"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q2/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q2/dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "Placeholder_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "12"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q2/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "300"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q2/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q2/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "main/q2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "main/pi/dense/Relu", "op": "_FusedMatMul", "input": ["Placeholder_1", "main/pi/dense/kernel", "main/pi/dense/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "main/q1/concat", "op": "ConcatV2", "input": ["Placeholder_1", "Placeholder_2", "main/q1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "main/q2/concat", "op": "ConcatV2", "input": ["Placeholder_1", "Placeholder_2", "main/q2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "main/pi/dense_1/Relu", "op": "_FusedMatMul", "input": ["main/pi/dense/Relu", "main/pi/dense_1/kernel", "main/pi/dense_1/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}}}, {"name": "main/q1/dense/Relu", "op": "_FusedMatMul", "input": ["main/q1/concat", "main/q1/dense/kernel", "main/q1/dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "main/q2/dense/Relu", "op": "_FusedMatMul", "input": ["main/q2/concat", "main/q2/dense/kernel", "main/q2/dense/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}}}, {"name": "main/pi/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["main/pi/dense_1/Relu", "main/pi/dense_2/kernel", "main/pi/dense_2/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "main/pi/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["main/pi/dense_1/Relu", "main/pi/dense_3/kernel", "main/pi/dense_3/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "main/q1/dense_1/Relu", "op": "_FusedMatMul", "input": ["main/q1/dense/Relu", "main/q1/dense_1/kernel", "main/q1/dense_1/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "main/q2/dense_1/Relu", "op": "_FusedMatMul", "input": ["main/q2/dense/Relu", "main/q2/dense_1/kernel", "main/q2/dense_1/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "main/pi/Tanh", "op": "Tanh", "input": ["main/pi/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/pi/Shape", "op": "Shape", "input": ["main/pi/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "main/pi/clip_by_value/Minimum", "op": "Minimum", "input": ["main/pi/dense_3/BiasAdd", "main/pi/clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/q1/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["main/q1/dense_1/Relu", "main/q1/dense_2/kernel", "main/q1/dense_2/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "main/q2/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["main/q2/dense_1/Relu", "main/q2/dense_2/kernel", "main/q2/dense_2/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "main/mul", "op": "Identity", "input": ["main/pi/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/pi/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["main/pi/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}}}, {"name": "main/pi/clip_by_value", "op": "Maximum", "input": ["main/pi/clip_by_value/Minimum", "main/pi/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/q1/Squeeze", "op": "Squeeze", "input": ["main/q1/dense_2/BiasAdd"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "main/q2/Squeeze", "op": "Squeeze", "input": ["main/q2/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "main/pi/Exp", "op": "Exp", "input": ["main/pi/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/pi/mul", "op": "Mul", "input": ["main/pi/random_normal/RandomStandardNormal", "main/pi/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/pi/add", "op": "AddV2", "input": ["main/pi/dense_2/BiasAdd", "main/pi/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/pi/Tanh_1", "op": "Tanh", "input": ["main/pi/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "main/mul_1", "op": "Identity", "input": ["main/pi/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "main/pi/dense_2/kernel", "shape": [300, 12], "dtype": "float32"}, {"name": "main/pi/dense_2/bias", "shape": [12], "dtype": "float32"}, {"name": "main/pi/dense/kernel", "shape": [42, 400], "dtype": "float32"}, {"name": "main/pi/dense/bias", "shape": [400], "dtype": "float32"}, {"name": "main/pi/dense_1/kernel", "shape": [400, 300], "dtype": "float32"}, {"name": "main/pi/dense_1/bias", "shape": [300], "dtype": "float32"}, {"name": "main/pi/dense_3/kernel", "shape": [300, 12], "dtype": "float32"}, {"name": "main/pi/dense_3/bias", "shape": [12], "dtype": "float32"}, {"name": "main/pi/clip_by_value/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "main/pi/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "main/q1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "main/q1/dense/kernel", "shape": [54, 400], "dtype": "float32"}, {"name": "main/q1/dense/bias", "shape": [400], "dtype": "float32"}, {"name": "main/q1/dense_1/kernel", "shape": [400, 300], "dtype": "float32"}, {"name": "main/q1/dense_1/bias", "shape": [300], "dtype": "float32"}, {"name": "main/q1/dense_2/kernel", "shape": [300, 1], "dtype": "float32"}, {"name": "main/q1/dense_2/bias", "shape": [1], "dtype": "float32"}, {"name": "main/q2/dense/kernel", "shape": [54, 400], "dtype": "float32"}, {"name": "main/q2/dense_2/kernel", "shape": [300, 1], "dtype": "float32"}, {"name": "main/q2/dense/bias", "shape": [400], "dtype": "float32"}, {"name": "main/q2/dense_1/kernel", "shape": [400, 300], "dtype": "float32"}, {"name": "main/q2/dense_2/bias", "shape": [1], "dtype": "float32"}, {"name": "main/q2/dense_1/bias", "shape": [300], "dtype": "float32"}, {"name": "main/q2/concat/axis", "shape": [], "dtype": "int32"}]}]}